---
type: TableViewUIUtils
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# TableViewUIUtils

`Autodesk.Revit.UI.TableViewUIUtils` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | TestCellAndPromptToEditTypeParameter | 2016 | `public static bool TestCellAndPromptToEditTypeParameter ( TableView tableView , SectionType sectionType , int row , int column )` |